app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("content", "created_at", "name", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "raja gangu teli"], ["created_at", "2015-03-05 04:29:02.100977"], ["name", "kaha "], ["post_id", 3], ["updated_at", "2015-03-05 04:29:02.100977"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:name, :content))