app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
	def index
		@post = Post.all.order('created_at DESC')

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "A dalla is a bitch seller"], ["created_at", "2015-01-23 09:42:24.177604"], ["title", "Dalla"], ["updated_at", "2015-01-23 09:42:24.177604"], ["user_id", 1]]
---
	def create
		@post = current_user.posts.build(post_params)

		if @post.save